#1 将一个列表的所有索引值和里面的所有数字求和。
#算法：




#2 将一个列表中所有字符串的索引位置和字符串内容，放到一个字典中。
#3 写一个循环，不断的问用户想买什么，用户选择一个商品编号，就把对应的商品添加到购物车里， 最终用户输入q退出时，打印购物车里的商品列表。
#4 一个字符串I am a boy，请依照如下规则转换为数字。abc–2, def–3, ghi–4, jkl–5, mno–6, pqrs–7, tuv–8 wxyz–9
#5 两个列表[1,3,5,7]和[2,4,6,8]合并为[1,2,3,4,5,6,7,8]
#6 [1,2,3,4,5,6,7,8],多次打印这个列表，每次打印前删除中间那个元素，直到最后剩一个元素。
#7 [6,2,11,1,4,9,5,7,8,20]将所有比6小的数字放到它的左边，大的放到6的右边。
#8 使用递归的方式倒序打印这个列表[1,2,3,4,5,6]
#9 使用递归的方式正序打印这个列表[1,2,3,4,5,6]
#10 程序自动生成一个奇数且能被3和5整除的二维列表。
#11 使用26个小写字母和26个小写字母对应的ascii生成一个字典
#12 使用26个字母对应随机的asicii码（97-122之间），基于这个字典规则,将一个单词进行加密
#13 将12题的加密串进行解密
#14 写一个函数传入一个List列表，生成一个字典：所有元素作为字典的key（注意判断合法性，不合法的滤掉），value都为1
#15 生成一个n级深度的字典，例如：[1,2,3,4,5,6] 可以生成{1: {2: {3: {4: {6: 5}}}}}，写一个函数定义n级
#16 {1: {2: {3: {4: {6: 5}}}}} 将所有key和value的数字求和，且层数可能不一定。